# GetGroupTypeId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalDefinition..::..GetGroupTypeId Method
ExternalDefinition Class See Also
---
Returns the identifier of the parameter definition's parameter group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override ForgeTypeId GetGroupTypeId()
```

Visual Basic
---
```text
Public Overrides Function GetGroupTypeId As ForgeTypeId
```

Visual C++
---
```text
public:
virtual ForgeTypeId^ GetGroupTypeId() override
```

# See Also
ExternalDefinition Class
Autodesk.Revit.DB Namespace